
6.대소문자 변환

In [1]:
import pandas as pd

In [2]:
file='../DATA/chicago_food_inspections.csv'

In [3]:
chicaDF=pd.read_csv(file)

In [4]:
chicaDF

                                      Name             Risk
0               MARRIOT MARQUIS CHICAGO       Risk 1 (High)
1                              JETS PIZZA   Risk 2 (Medium)
2                               ROOM 1520      Risk 3 (Low)
3                MARRIOT MARQUIS CHICAGO      Risk 1 (High)
4                            CHARTWELLS       Risk 1 (High)
...                                    ...              ...
153805                         WOLCOTT'S      Risk 1 (High)
153806     DUNKIN DONUTS/BASKIN-ROBBINS     Risk 2 (Medium)
153807                           Cafe 608     Risk 1 (High)
153808                        mr.daniel's     Risk 1 (High)
153809                         TEMPO CAFE     Risk 1 (High)

[153810 rows x 2 columns]

In [5]:
chicaDF['Risk']=chicaDF['Risk'].astype('category')

In [6]:
chicaDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153810 entries, 0 to 153809
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Name    153810 non-null  object
 1   Risk    153744 non-null  category
dtypes: category(1), object(1)
memory usage: 1.3+ MB

In [7]:
chicaDF["Name"].str.rstrip().head()

0      MARRIOT MARQUIS CHICAGO
1                   JETS PIZZA
2                    ROOM 1520
3      MARRIOT MARQUIS CHICAGO
4                   CHARTWELLS
Name: Name, dtype: object

In [8]:
chicaDF["Name"].str.strip().head()

0    MARRIOT MARQUIS CHICAGO
1                 JETS PIZZA
2                  ROOM 1520
3    MARRIOT MARQUIS CHICAGO
4                 CHARTWELLS
Name: Name, dtype: object

6.2 문자열 슬라이싱

In [9]:
chicaDF['Risk']

0           Risk 1 (High)
1         Risk 2 (Medium)
2            Risk 3 (Low)
3           Risk 1 (High)
4           Risk 1 (High)
               ...
153805      Risk 1 (High)
153806    Risk 2 (Medium)
153807      Risk 1 (High)
153808      Risk 1 (High)
153809      Risk 1 (High)
Name: Risk, Length: 153810, dtype: category
Categories (4, object): ['All', 'Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)']

In [10]:
chicaDF=chicaDF.dropna(subset=['Risk']) #결측값 제거

In [11]:
chicaDF["Risk"].unique()  #결측값 사라짐....

['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'All']
Categories (4, object): ['All', 'Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)']

In [12]:
chicaDF=chicaDF.replace('All','Risk 4(Extreme)')

In [13]:
chicaDF["Risk"].unique()

['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'Risk 4(Extreme)']
Categories (4, object): ['Risk 4(Extreme)', 'Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)']

6.3 문자열 슬라이싱

In [15]:
chicaDF["Risk"].str.slice(5,6).head()

0    1
1    2
2    3
3    1
4    1
Name: Risk, dtype: object

In [17]:
chicaDF["Risk"].str[5:6].head()

0    1
1    2
2    3
3    1
4    1
Name: Risk, dtype: object

In [18]:
chicaDF["Risk"].str.slice(8).head() #인덱스8 에서 끝까지....

0      High)
1    Medium)
2       Low)
3      High)
4      High)
Name: Risk, dtype: object

In [19]:
chicaDF["Risk"].str.slice(8,-1).head() #이러면 마지막꺼는 안된다....

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: object

In [20]:
chicaDF["Risk"].str.slice(8).str.replace(")","").head()

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: object

6.4 불리언 메서드

In [25]:
pizmask=chicaDF["Name"].str.lower().str.contains("pizza")

In [26]:
chicaDF[pizmask]

                                        Name             Risk
1                                JETS PIZZA   Risk 2 (Medium)
19           NANCY'S HOME OF STUFFED PIZZA      Risk 1 (High)
27             NARY'S GRILL & PIZZA ,INC.       Risk 1 (High)
29                     NARYS GRILL & PIZZA      Risk 1 (High)
68                          COLUTAS PIZZA       Risk 1 (High)
...                                      ...              ...
153756          ANGELO'S STUFFED PIZZA CORP     Risk 1 (High)
153764                 COCHIAROS PIZZA #2       Risk 1 (High)
153772     FERNANDO'S MEXICAN GRILL & PIZZA     Risk 1 (High)
153788               REGGIO'S PIZZA EXPRESS     Risk 1 (High)
153801          State Street Pizza Company      Risk 1 (High)

[3992 rows x 2 columns]

In [27]:
#str.startswith() => 뭘로 시작하나
#str.endsswith() => 뭘로 끝나나

6.5 문자열 분할

In [28]:
file2='../DATA/customers.csv'

In [31]:
customerDF=pd.read_csv(file2)

In [32]:
customerDF

                     Name                                            Address
0           Frank Manning  6461 Quinn Groves, East Matthew, New Hampshire...
1       Elizabeth Johnson  1360 Tracey Ports Apt. 419, Kyleport, Vermont,...
2         Donald Stephens  19120 Fleming Manors, Prestonstad, Montana, 23495
3     Michael Vincent III       441 Olivia Creek, Jimmymouth, Georgia, 82991
4          Jasmine Zamora  4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...
...                   ...                                                ...
9956        Dana Browning  762 Andrew Views Apt. 254, North Paul, New Mex...
9957      Amanda Anderson  44188 Day Crest Apt. 901, Lake Marcia, Maine, ...
9958           Eric Davis  73015 Michelle Squares, Watsonville, West Virg...
9959     Taylor Hernandez       129 Keith Greens, Haleyfurt, Oklahoma, 98916
9960     Sherry Nicholson   355 Griffin Valley, Davidtown, New Mexico, 17581

[9961 rows x 2 columns]

In [33]:
customerDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9961 entries, 0 to 9960
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     9961 non-null   object
 1   Address  9961 non-null   object
dtypes: object(2)
memory usage: 155.8+ KB

In [36]:
customerDF['Name'].str.split(' ') # split=> 분할하여 리스트 생성해줌...

0              [Frank, Manning]
1          [Elizabeth, Johnson]
2            [Donald, Stephens]
3       [Michael, Vincent, III]
4             [Jasmine, Zamora]
                 ...
9956           [Dana, Browning]
9957         [Amanda, Anderson]
9958              [Eric, Davis]
9959        [Taylor, Hernandez]
9960        [Sherry, Nicholson]
Name: Name, Length: 9961, dtype: object

In [38]:
customerDF['Name'].str.split(' ',n=1)

0             [Frank, Manning]
1         [Elizabeth, Johnson]
2           [Donald, Stephens]
3       [Michael, Vincent III]
4            [Jasmine, Zamora]
                 ...
9956          [Dana, Browning]
9957        [Amanda, Anderson]
9958             [Eric, Davis]
9959       [Taylor, Hernandez]
9960       [Sherry, Nicholson]
Name: Name, Length: 9961, dtype: object

In [41]:
# 여기서 리스트 형태로 전달되므로 인덱스를 사용해 이름이나 성을 가져올 수 있다. => str.get(0) 메서드

In [42]:
customerDF['Name'].str.split(' ',n=1).str.get(0)

0           Frank
1       Elizabeth
2          Donald
3         Michael
4         Jasmine
          ...
9956         Dana
9957       Amanda
9958         Eric
9959       Taylor
9960       Sherry
Name: Name, Length: 9961, dtype: object

In [44]:
customerDF['Name'].str.split(' ',n=1).str.get(1)

0           Manning
1           Johnson
2          Stephens
3       Vincent III
4            Zamora
           ...
9956       Browning
9957       Anderson
9958          Davis
9959      Hernandez
9960      Nicholson
Name: Name, Length: 9961, dtype: object

In [45]:
customerDF['Name'].str.split(' ',n=1).str.get(-1)

0           Manning
1           Johnson
2          Stephens
3       Vincent III
4            Zamora
           ...
9956       Browning
9957       Anderson
9958          Davis
9959      Hernandez
9960      Nicholson
Name: Name, Length: 9961, dtype: object

In [46]:
customerDF['Name'].str.split(' ',n=1,expand=True)

              0            1
0         Frank      Manning
1     Elizabeth      Johnson
2        Donald     Stephens
3       Michael  Vincent III
4       Jasmine       Zamora
...         ...          ...
9956       Dana     Browning
9957     Amanda     Anderson
9958       Eric        Davis
9959     Taylor    Hernandez
9960     Sherry    Nicholson

[9961 rows x 2 columns]

In [48]:
customerDF['Name'].str.split(' ',expand=True) # 임계치를 설정하지 않으면 none 값이 할당될 수 있다.

              0          1     2
0         Frank    Manning  None
1     Elizabeth    Johnson  None
2        Donald   Stephens  None
3       Michael    Vincent   III
4       Jasmine     Zamora  None
...         ...        ...   ...
9956       Dana   Browning  None
9957     Amanda   Anderson  None
9958       Eric      Davis  None
9959     Taylor  Hernandez  None
9960     Sherry  Nicholson  None

[9961 rows x 3 columns]

In [53]:
customerDF[['First Name','Last Name']]=customerDF["Name"].str.split(' ',n=1,expand=True) #새로운 2열 연결

In [52]:
customerDF

,Name,Address,First Name,Last Name
0,Frank Manning,"6461 Quinn Groves, East Matthew, New Hampshire...",Frank,Manning
1,Elizabeth Johnson,"1360 Tracey Ports Apt. 419, Kyleport, Vermont,...",Elizabeth,Johnson
2,Donald Stephens,"19120 Fleming Manors, Prestonstad, Montana, 23495",Donald,Stephens
3,Michael Vincent III,"441 Olivia Creek, Jimmymouth, Georgia, 82991",Michael,Vincent III
4,Jasmine Zamora,"4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...",Jasmine,Zamora
...,...,...,...,...
9956,Dana Browning,"762 Andrew Views Apt. 254, North Paul, New Mex...",Dana,Browning
9957,Amanda Anderson,"44188 Day Crest Apt. 901, Lake Marcia, Maine, ...",Amanda,Anderson
9958,Eric Davis,"73015 Michelle Squares, Watsonville, West Virg...",Eric,Davis
9959,Taylor Hernandez,"129 Keith Greens, Haleyfurt, Oklahoma, 98916",Taylor,Hernandez
9960,Sherry Nicholson,"355 Griffin Valley, Davidtown, New Mexico, 17581",Sherry,Nicholson

In [56]:
customerDF.drop(labels='Name',axis='columns')

,Address,First Name,Last Name
0,"6461 Quinn Groves, East Matthew, New Hampshire...",Frank,Manning
1,"1360 Tracey Ports Apt. 419, Kyleport, Vermont,...",Elizabeth,Johnson
2,"19120 Fleming Manors, Prestonstad, Montana, 23495",Donald,Stephens
3,"441 Olivia Creek, Jimmymouth, Georgia, 82991",Michael,Vincent III
4,"4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...",Jasmine,Zamora
...,...,...,...
9956,"762 Andrew Views Apt. 254, North Paul, New Mex...",Dana,Browning
9957,"44188 Day Crest Apt. 901, Lake Marcia, Maine, ...",Amanda,Anderson
9958,"73015 Michelle Squares, Watsonville, West Virg...",Eric,Davis
9959,"129 Keith Greens, Haleyfurt, Oklahoma, 98916",Taylor,Hernandez
9960,"355 Griffin Valley, Davidtown, New Mexico, 17581",Sherry,Nicholson

6.6 코딩 챌린지

In [59]:
customerDF["Address"].str.split(',',expand=True)

                               0              1               2       3
0              6461 Quinn Groves   East Matthew   New Hampshire   16656
1     1360 Tracey Ports Apt. 419       Kyleport         Vermont   31924
2           19120 Fleming Manors    Prestonstad         Montana   23495
3               441 Olivia Creek     Jimmymouth         Georgia   82991
4     4246 Chelsey Ford Apt. 310      Karamouth            Utah   76252
...                          ...            ...             ...     ...
9956   762 Andrew Views Apt. 254     North Paul      New Mexico   28889
9957    44188 Day Crest Apt. 901    Lake Marcia           Maine   37378
9958      73015 Michelle Squares    Watsonville   West Virginia   03933
9959            129 Keith Greens      Haleyfurt        Oklahoma   98916
9960          355 Griffin Valley      Davidtown      New Mexico   17581

[9961 rows x 4 columns]

In [61]:
customerDF[['street','city'
            ,'state','mailaddress']]=customerDF["Address"].str.split(',',expand=True)

In [62]:
customerDF

,Name,Address,First Name,Last Name,street,city,state,mailaddress
0,Frank Manning,"6461 Quinn Groves, East Matthew, New Hampshire...",Frank,Manning,6461 Quinn Groves,East Matthew,New Hampshire,16656
1,Elizabeth Johnson,"1360 Tracey Ports Apt. 419, Kyleport, Vermont,...",Elizabeth,Johnson,1360 Tracey Ports Apt. 419,Kyleport,Vermont,31924
2,Donald Stephens,"19120 Fleming Manors, Prestonstad, Montana, 23495",Donald,Stephens,19120 Fleming Manors,Prestonstad,Montana,23495
3,Michael Vincent III,"441 Olivia Creek, Jimmymouth, Georgia, 82991",Michael,Vincent III,441 Olivia Creek,Jimmymouth,Georgia,82991
4,Jasmine Zamora,"4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...",Jasmine,Zamora,4246 Chelsey Ford Apt. 310,Karamouth,Utah,76252
...,...,...,...,...,...,...,...,...
9956,Dana Browning,"762 Andrew Views Apt. 254, North Paul, New Mex...",Dana,Browning,762 Andrew Views Apt. 254,North Paul,New Mexico,28889
9957,Amanda Anderson,"44188 Day Crest Apt. 901, Lake Marcia, Maine, ...",Amanda,Anderson,44188 Day Crest Apt. 901,Lake Marcia,Maine,37378
9958,Eric Davis,"73015 Michelle Squares, Watsonville, West Virg...",Eric,Davis,73015 Michelle Squares,Watsonville,West Virginia,03933
9959,Taylor Hernandez,"129 Keith Greens, Haleyfurt, Oklahoma, 98916",Taylor,Hernandez,129 Keith Greens,Haleyfurt,Oklahoma,98916
9960,Sherry Nicholson,"355 Griffin Valley, Davidtown, New Mexico, 17581",Sherry,Nicholson,355 Griffin Valley,Davidtown,New Mexico,17581

In [66]:
customerDF.drop(labels='Address',axis='columns')

,Name,First Name,Last Name,street,city,state,mailaddress
0,Frank Manning,Frank,Manning,6461 Quinn Groves,East Matthew,New Hampshire,16656
1,Elizabeth Johnson,Elizabeth,Johnson,1360 Tracey Ports Apt. 419,Kyleport,Vermont,31924
2,Donald Stephens,Donald,Stephens,19120 Fleming Manors,Prestonstad,Montana,23495
3,Michael Vincent III,Michael,Vincent III,441 Olivia Creek,Jimmymouth,Georgia,82991
4,Jasmine Zamora,Jasmine,Zamora,4246 Chelsey Ford Apt. 310,Karamouth,Utah,76252
...,...,...,...,...,...,...,...
9956,Dana Browning,Dana,Browning,762 Andrew Views Apt. 254,North Paul,New Mexico,28889
9957,Amanda Anderson,Amanda,Anderson,44188 Day Crest Apt. 901,Lake Marcia,Maine,37378
9958,Eric Davis,Eric,Davis,73015 Michelle Squares,Watsonville,West Virginia,03933
9959,Taylor Hernandez,Taylor,Hernandez,129 Keith Greens,Haleyfurt,Oklahoma,98916
9960,Sherry Nicholson,Sherry,Nicholson,355 Griffin Valley,Davidtown,New Mexico,17581